<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>PayloadContent</key>
        <array>
            <dict>
                <key>PayloadDisplayName</key>
                <string>Check - Microsoft 365 Phishing Protection (Edge)</string>
                <key>PayloadIdentifier</key>
                <string>com.cyberdrain.check.edge.settings</string>
                <key>PayloadType</key>
                <string>com.microsoft.Edge.extensions.knepjpocdagponkonnbggpcnhnaikajg</string>
                <key>PayloadUUID</key>
                <string>C2D3E4F5-6789-ABCD-EF01-234567890ABC</string>
                <key>PayloadVersion</key>
                <integer>1</integer>
                <!-- Security Settings -->
                <key>showNotifications</key>
                <dict>
                    <key>Value</key>
                    <true />
                </dict>
                <key>enableValidPageBadge</key>
                <dict>
                    <key>Value</key>
                    <true />
                </dict>
                <key>enablePageBlocking</key>
                <dict>
                    <key>Value</key>
                    <true />
                </dict>
                <key>enableCippReporting</key>
                <dict>
                    <key>Value</key>
                    <false />
                </dict>
                <key>cippServerUrl</key>
                <dict>
                    <key>Value</key>
                    <string />
                </dict>
                <key>cippTenantId</key>
                <dict>
                    <key>Value</key>
                    <string />
                </dict>
                <key>customRulesUrl</key>
                <dict>
                    <key>Value</key>
                    <string />
                </dict>
                <key>updateInterval</key>
                <dict>
                    <key>Value</key>
                    <integer>24</integer>
                </dict>
                <!-- Logging Settings -->
                <key>enableDebugLogging</key>
                <dict>
                    <key>Value</key>
                    <false />
                </dict>
                <!-- Custom Branding Settings -->
                <key>customBranding</key>
                <dict>
                    <key>Value</key>
                    <dict>
                        <key>companyName</key>
                        <string />
                        <key>productName</key>
                        <string />
                        <key>supportEmail</key>
                        <string />
                        <key>primaryColor</key>
                        <string>#F77F00</string>
                        <key>logoUrl</key>
                        <string />
                    </dict>
                </dict>
            </dict>
        </array>
        <key>PayloadDescription</key>
        <string>Configuration profile for Check - Microsoft 365 Phishing Protection extension for Microsoft Edge. This profile manages security settings, branding options, and logging preferences for enterprise deployment.</string>
        <key>PayloadDisplayName</key>
        <string>Check Extension Configuration (Edge)</string>
        <key>PayloadIdentifier</key>
        <string>com.cyberdrain.check.edge.configuration</string>
        <key>PayloadOrganization</key>
        <string>CyberDrain</string>
        <key>PayloadRemovalDisallowed</key>
        <false />
        <key>PayloadScope</key>
        <string>System</string>
        <key>PayloadType</key>
        <string>Configuration</string>
        <key>PayloadUUID</key>
        <string>D4E5F6A7-B8C9-DEF0-1234-56789ABCDEF0</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>TargetDeviceType</key>
        <integer>5</integer>
    </dict>
</plist>